import { ReactComponent as Icon1 } from '../../Images/Info Cards/approve.svg';
import { ReactComponent as Icon2 } from '../../Images/Info Cards/bike.svg';
import { ReactComponent as Icon3 } from '../../Images/Info Cards/OnlineMessaging.svg';
import { ReactComponent as Icon4 } from '../../Images/Info Cards/Traveling.svg';

const AboutUsData = [
  {
    Image: Icon1,
    title: 'ارایه خدمات در سراسر کشور',
    txt:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز',
  },
  {
    Image: Icon2,
    title: 'ارایه خدمات در سراسر کشور',
    txt:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز',
  },
  {
    Image: Icon3,
    title: 'ارایه خدمات در سراسر کشور',
    txt:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز',
  },
  {
    Image: Icon4,
    title: 'ارایه خدمات در سراسر کشور',
    txt:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز',
  },
];

export default AboutUsData;
